## Production: alarms 🚨
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 0 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                             NAME                              |
|--------|---------------------------------------------------------------|
| add    | `aws_cloudwatch_log_metric_filter.glue_etl_pythonshell_error` |
|        | `aws_cloudwatch_log_metric_filter.glue_etl_spark_error`       |
|        | `aws_cloudwatch_metric_alarm.glue_etl_pythonshell_error`      |
|        | `aws_cloudwatch_metric_alarm.glue_etl_spark_error`            |
| delete | `aws_cloudwatch_log_metric_filter.glue_etl_error`             |
|        | `aws_cloudwatch_metric_alarm.glue_etl_error`                  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.glue_etl_error will be destroyed
  # (because aws_cloudwatch_log_metric_filter.glue_etl_error is not in configuration)
  - resource "aws_cloudwatch_log_metric_filter" "glue_etl_error" {
      - id             = "glue-etl-error" -> null
      - log_group_name = "/aws-glue/jobs/encryption-at-rest-role/service-role/AWSGlueETL-DataLake/output" -> null
      - name           = "glue-etl-error" -> null
      - pattern        = "ERROR" -> null

      - metric_transformation {
          - default_value = "0" -> null
          - dimensions    = {} -> null
          - name          = "glue-etl-error" -> null
          - namespace     = "data-lake" -> null
          - unit          = "Count" -> null
          - value         = "1" -> null
        }
    }

  # aws_cloudwatch_log_metric_filter.glue_etl_pythonshell_error will be created
  + resource "aws_cloudwatch_log_metric_filter" "glue_etl_pythonshell_error" {
      + id             = (known after apply)
      + log_group_name = "mock-glue-etl-pythonshell-log-group/error"
      + name           = "glue-etl-pythonshell-error"
      + pattern        = "ERROR"

      + metric_transformation {
          + default_value = "0"
          + name          = "glue-etl-pythonshell-error"
          + namespace     = "data-lake"
          + unit          = "Count"
          + value         = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.glue_etl_spark_error will be created
  + resource "aws_cloudwatch_log_metric_filter" "glue_etl_spark_error" {
      + id             = (known after apply)
      + log_group_name = "mock-glue-etl-spark-log-group/error"
      + name           = "glue-etl-spark-error"
      + pattern        = "[(w1=\"*ERROR*com.amazonaws.services.glue.log.GlueLogger*\")]"

      + metric_transformation {
          + default_value = "0"
          + name          = "glue-etl-spark-error"
          + namespace     = "data-lake"
          + unit          = "Count"
          + value         = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.glue_etl_error will be destroyed
  # (because aws_cloudwatch_metric_alarm.glue_etl_error is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "glue_etl_error" {
      - actions_enabled                       = true -> null
      - alarm_actions                         = [
          - "arn:aws:sns:ca-central-1:739275439843:cloudwatch-alarm-action",
        ] -> null
      - alarm_description                     = "Errors logged over 1 minute by a Glue ETL job." -> null
      - alarm_name                            = "glue-etl-error" -> null
      - arn                                   = "arn:aws:cloudwatch:ca-central-1:739275439843:alarm:glue-etl-error" -> null
      - comparison_operator                   = "GreaterThanThreshold" -> null
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {} -> null
      - evaluation_periods                    = 1 -> null
      - id                                    = "glue-etl-error" -> null
      - insufficient_data_actions             = [] -> null
      - metric_name                           = "glue-etl-error" -> null
      - namespace                             = "data-lake" -> null
      - ok_actions                            = [
          - "arn:aws:sns:ca-central-1:739275439843:cloudwatch-ok-action",
        ] -> null
      - period                                = 60 -> null
      - statistic                             = "Sum" -> null
      - tags                                  = {} -> null
      - tags_all                              = {
          - "CostCentre" = "PlatformDataLake"
          - "Terraform"  = "true"
        } -> null
      - threshold                             = 0 -> null
      - treat_missing_data                    = "notBreaching" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.glue_etl_pythonshell_error will be created
  + resource "aws_cloudwatch_metric_alarm" "glue_etl_pythonshell_error" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:739275439843:cloudwatch-alarm-action",
        ]
      + alarm_description                     = "Errors logged over 1 minute by a Glue ETL pythonshell job."
      + alarm_name                            = "glue-etl-pythonshell-error"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "glue-etl-pythonshell-error"
      + namespace                             = "data-lake"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:739275439843:cloudwatch-ok-action",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.glue_etl_spark_error will be created
  + resource "aws_cloudwatch_metric_alarm" "glue_etl_spark_error" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:739275439843:cloudwatch-alarm-action",
        ]
      + alarm_description                     = "Errors logged over 1 minute by a Glue ETL spark job."
      + alarm_name                            = "glue-etl-spark-error"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "glue-etl-spark-error"
      + namespace                             = "data-lake"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:739275439843:cloudwatch-ok-action",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

Plan: 4 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.glue_job_failure"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.glue_crawler_error"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.glue_etl_pythonshell_error"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.glue_etl_spark_error"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.glue_job_failures"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.cloudwatch"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.cloudwatch_alarm_action"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.cloudwatch_ok_action"]

27 tests, 19 passed, 8 warnings, 0 failures, 0 exceptions

```

</details>
